OdRxSystemServices.getTempFileName
\details
Returns the unique name for temporary file.

OdRxSystemServices.getUserName(Oda.UserNameFormat)
\details
Returns user name in the requested format

OdRxSystemServices.getTemporaryPath
\details
Returns the path to the temporary files folder.

OdRxSystemServices.setEnvVar(OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Set environment variable value.
\param varName [in]  Environment variable name.
\param newValue [in]  The new value of the environment variable.

OdRxSystemServices.getEnvVar(OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdString*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Get environment variable value.
\param varName [in]  Environment variable name.
\param value [out]  Environment variable value.

OdRxSystemServices.initModelerLibrary(OdRxDictionary*)
\details
Inits/Uninits the modeler library (platform-dependent) module.
\returns
Should return eOk, if (un)initialization is implemented inside (un)initModelerLibrary.
Or eNotImplemented if default module (un)initialization required.
\remarks
Used for custom initialization/uninitialization of Spatial ACIS library.

OdRxSystemServices.loadModuleLib(OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Boolean)
\details
Loads the specified physical (platform-dependent) module.
\returns
Returns the abstract (platform independent) module object,
which represents module functionality in Teigha.
\param moduleFileName [in]  Module filename to load.
\param silent [in]  If true, no load status message will be printed.

OdRxSystemServices.warning(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*,OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Displays in some manner the specified warning message.
\param warnVisGroup [in]  Group of warning message visibility (always visible if it is an empty).
\param message [in]  Warning message.

OdRxSystemServices.warning(OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Displays in some manner the specified warning message.
\param message [in]  Warning message.

OdRxSystemServices.findModule(OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the filename associated with the specified application name.
\param applicationName [in]  TX application name.

OdRxSystemServices.unloadModule(OdRxModule*)
\details
Unloads the specified physical (platform-dependent) module.
\param pModuleObj [in]  Pointer to the module object to be unloaded.

OdRxSystemServices.loadModule(OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Boolean)
\details
Loads the specified physical (platform-dependent) module.
\remarks
Appends the appropriate version suffix onto the supplied module name.
Returns the abstract (platform independent) module object,
which represents module functionality in Teigha.
\param moduleFileName [in]  Module filename to load.
\param silent [in]  If true, no load status message will be printed.

OdRxSystemServices.createOdGUID
\details
Returns a newly generated Globally Unique IDentifier (GUID) for this SystemServices object.

OdRxSystemServices.createGuid
\details
Returns a string representation for newly generated Globally Unique IDentifier (GUID) for this SystemServices object.

OdRxSystemServices.systemCodePage
\details
Returns the system code page.

OdRxSystemServices.formatMsg(System.UInt32,BTEllipsis)
\details
Assigns a value to this String object using a printf-style format string and arguments.
\param formatID [in]  String resource identifier containing the format string.
\returns
Returns a reference to this String Object.

OdRxSystemServices.formatMessage(System.UInt32,System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte**)
\details
Returns a message string formatted using a vsprintf-style format string and argument list.
\param formatID [in]  String resource identifier containing the format string.
\param argList [in]  Argument list.

OdRxSystemServices.getFileSize(OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the size of the specified file.
\param filename [in]  Filename.
\remarks
On most platforms, this function will be implemented with the stat function (stat::st_size).

OdRxSystemServices.getFileMTime(OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the modification time of the specified file.
\param filename [in]  Filename.
\remarks
On most platforms, this function will be implemented with the stat function (stat::st_mtime).

OdRxSystemServices.getFileCTime(OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the creation time of the specified file.
\param filename [in]  Filename.
\remarks
On most platforms, this function will be implemented with the stat function (stat::st_ctime).

OdRxSystemServices.accessFile(OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Int32)
\details
Returns true if and only if the specified file can be accessed in the specified mode.
\param filename [in]  Filename.
\param accessMode [in]  Access mode.
\remarks
accessMode must be a combination of one or more of the following:
Name                Value          Description
..                  0              File exists.
Oda::kFileRead      0x80000000     Read access.
Oda::kFileWrite     0x40000000     Write access.

OdRxSystemServices.createFile(OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,Oda.FileAccessMode,Oda.FileShareMode,Oda.FileCreationDisposition)
\details
Creates and/or opens the specified file.
\param filename [in]  Filename.
\param accessMode [in]  Access mode.
\param shareMode [in]  Share mode.
\param creationDisposition [in]  Creation disposition.
\returns
Returns a SmartPointer to an OdStreamBuf object for the file.
\remarks
accessMode must be a combination of one or more of the following:
Name                Value          Description
Oda::kFileRead      0x80000000     Read access.
Oda::kFileWrite     0x40000000     Write access.
shareMode must be one of the following:
Name                         Value       Description
Oda::kShareDenyReadWrite     0x10        deny read/write mode
Oda::kShareDenyWrite         0x20        deny write mode
Oda::kShareDenyRead          0x30        deny read mode
Oda::kShareDenyNo            0x40        deny none mode
Creation disposition must be one of the following:
Name                         Value     Description
Oda::kCreateNew              1         Creates a new file; fails if the specified file already exists.
Oda::kCreateAlways           2         Creates a new file; overwrites any existing file.
Oda::kOpenExisting           3         Opens the file; fails if the file does not exist.
Oda::kOpenAlways             4         Opens the file; creates the file if it does not exist.
Oda::kTruncateExisting       5         Truncates the file; fails if the file does not exist. The file must be open at least Oda::kFileWrite.